# Exercise 1. - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out [Occupation Exercises Video Tutorial](https://www.youtube.com/watch?v=W8AB5s-L3Rw&list=PLgJhDSE2ZLxaY_DigHeiIDC1cD09rXgJv&index=4) to watch a data scientist go through the exercises

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep="|", index_col=0)
users.head(3)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

### Step 4. See the first 25 entries

In [4]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [5]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [6]:
print(len(users))

943

#### OR:

In [7]:
users.shape[0]

943

### Step 7. What is the number of columns in the dataset?

In [8]:
i=0
for columns in users.columns:
    i+=1
print(i)

4

#### OR:

In [9]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [10]:
for columns in users.columns:
    print(columns)

age
gender
occupation
zip_code

#### OR:

In [11]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [12]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [13]:
users['gender'] = users['gender'].convert_dtypes(str)
users['occupation'] = users['occupation'].convert_dtypes(str)
users['zip_code'] = users['zip_code'].convert_dtypes(str)
users.dtypes

age                    int64
gender        string[python]
occupation    string[python]
zip_code      string[python]
dtype: object

### Step 11. Print only the occupation column

In [14]:
users.occupation.head(10)

user_id
1        technician
2             other
3            writer
4        technician
5             other
6         executive
7     administrator
8     administrator
9           student
10           lawyer
Name: occupation, dtype: string

#### OR:

In [15]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: string

### Step 12. How many different occupations are in this dataset?

In [16]:
users.occupation.nunique()

21

### Step 13. What is the most frequent occupation?

In [17]:
users.occupation.value_counts().head(1)

occupation
student    196
Name: count, dtype: Int64

### Step 14. Summarize the DataFrame.

In [18]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [19]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [20]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [21]:
afterdot = 2 # number of digits after the decimal point
MeanAge = users['age'].mean()
print(MeanAge.round(afterdot))

34.05

### Step 18. What is the age with least occurrence?

In [22]:
# iloc is for integer location, index != iloc (opposites)
t = users['age'].value_counts()
x = t.iloc[t.size-1]
print(t.index[t.size-1], end=' ')
for i in range(t.size-2, 0, -1):
    if t.iloc[i] == x:
        print(t.index[i], end = ' ')
    else:
        break
print('\n',"occured", x, "times")

73 10 66 11 7
 occured 1 times

#### OR:

In [23]:
users['age'].value_counts().tail(5)

age
7     1
11    1
66    1
10    1
73    1
Name: count, dtype: int64

# Exercise 2. - Filtering and Sorting Data

Check out [Euro 12 Exercises Video Tutorial](https://youtu.be/iqk5d48Qisg) to watch a data scientist go through the exercises

This time we are going to pull data directly from the internet.

### Step 1. Import the necessary libraries

In [24]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/kflisikowsky/pandas_exercises/refs/heads/main/Euro_2012_stats_TEAM.csv).

### Step 3. Assign it to a variable called euro12.

In [25]:
euro12 =  pd.read_csv('https://raw.githubusercontent.com/kflisikowsky/pandas_exercises/refs/heads/main/Euro_2012_stats_TEAM.csv')
euro12.head(3)

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,13,81.3%,41,62,2,9,0,9,9,16
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,9,60.1%,53,73,8,7,0,11,11,19
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,10,66.7%,25,38,8,4,0,7,7,15

### Step 4. Select only the Goal column.

In [26]:
goal = euro12['Goals']
goal.head(3)

0    4
1    4
2    4
Name: Goals, dtype: int64

### Step 5. How many team participated in the Euro2012?

In [27]:
len(euro12)

16

#### OR:

In [28]:
euro12.shape[0]

16

### Step 6. What is the number of columns in the dataset?

In [29]:
ccol = len(euro12.columns)
print(ccol)

35

#### OR:

In [30]:
euro12.shape[1]

35

### Step 7. View only the columns Team, Yellow Cards and Red Cards and assign them to a dataframe called discipline

In [31]:
discipline = euro12[['Team', 'Yellow Cards', 'Red Cards']]
discipline.head(3)

             Team  Yellow Cards  Red Cards
0         Croatia             9          0
1  Czech Republic             7          0
2         Denmark             4          0

### Step 8. Sort the teams by Red Cards, then to Yellow Cards

In [32]:
sortcards = discipline.sort_values(['Red Cards', 'Yellow Cards'], ascending = False)
sortcards.head(10)

                   Team  Yellow Cards  Red Cards
6                Greece             9          1
9                Poland             7          1
11  Republic of Ireland             6          1
7                 Italy            16          0
10             Portugal            12          0
13                Spain            11          0
0               Croatia             9          0
1        Czech Republic             7          0
14               Sweden             7          0
4                France             6          0

### Step 9. Calculate the mean Yellow Cards given per Team

In [33]:
afterdot = 2
MeanY = euro12['Yellow Cards'].mean()
print(MeanY.round(afterdot))

7.44

### Step 10. Filter teams that scored more than 6 goals

In [34]:
goals = euro12[euro12.Goals > 6].sort_values('Goals', ascending = False)
print(goals[['Goals']])

    Goals
13     12
5      10

### Step 11. Select the teams that start with G

In [35]:
Gteams = euro12[euro12.Team.str.startswith('G')]
Gteams[['Team']]

      Team
5  Germany
6   Greece

### Step 12. Select the first 7 columns

In [36]:
euro12.iloc[:, 0:7].head(3) # or simply :7

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked)
0,Croatia,4,13,12,51.9%,16.0%,32
1,Czech Republic,4,13,18,41.9%,12.9%,39
2,Denmark,4,10,10,50.0%,20.0%,27

### Step 13. Select all columns except the last 3.

In [37]:
euro12.iloc[:, 0:-3].head(3) # or simply :-3

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Clean Sheets,Blocks,Goals conceded,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards
0,Croatia,4,13,12,51.9%,16.0%,32,0,0,0,...,0,10,3,13,81.3%,41,62,2,9,0
1,Czech Republic,4,13,18,41.9%,12.9%,39,0,0,0,...,1,10,6,9,60.1%,53,73,8,7,0
2,Denmark,4,10,10,50.0%,20.0%,27,1,0,0,...,1,10,5,10,66.7%,25,38,8,4,0

### Step 14. Present only the Shooting Accuracy from England, Italy and Russia

In [38]:
euro12.loc[euro12['Team'].isin(['England', 'Italy', 'Russia']), ['Team', 'Shooting Accuracy']]

       Team Shooting Accuracy
3   England             50.0%
7     Italy             43.0%
12   Russia             22.5%

#### OR:

In [39]:
euro12.set_index('Team', inplace = True)
euro12.loc[['England', 'Italy', 'Russia'], 'Shooting Accuracy']

Team
England    50.0%
Italy      43.0%
Russia     22.5%
Name: Shooting Accuracy, dtype: object

# Exercise 3. - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  

Check out [Alcohol Consumption Exercises Video Tutorial](https://youtu.be/az67CMdmS6s) to watch a data scientist go through the exercises


### Step 1. Import the necessary libraries

In [40]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [41]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv', sep=",")
drinks.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

### Step 4. Which continent drinks more beer on average?

In [42]:
drinks.groupby('continent')['beer_servings'].mean().sort_values(ascending=False)

continent
EU    193.777778
SA    175.083333
OC     89.687500
AF     61.471698
AS     37.045455
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [43]:
rnd = 2
drinks.groupby('continent').wine_servings.describe().round(rnd)

           count    mean    std  min   25%    50%     75%    max
continent
AF          53.0   16.26  38.85  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.07  21.67  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.22  97.42  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.62  64.56  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.42  88.62  1.0   3.0   12.0   98.50  221.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [44]:
beer2 = drinks.groupby('continent').mean(numeric_only=True).round(2)
beer2
# beer2['beer_servings, wine_servings, spirit_servings, total_litres_of_pure_alcohol'.split(', ')].round(2)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.47,16.34,16.26,3.01
AS,37.05,60.84,9.07,2.17
EU,193.78,132.56,142.22,8.62
OC,89.69,58.44,35.62,3.38
SA,175.08,114.75,62.42,6.31

### Step 7. Print the median alcohol consumption per continent for every column

In [45]:
median1 = drinks.groupby('continent').median(numeric_only=True).round(2)
median1
# median1[['beer_servings', 'spirit_servings', 'wine_servings', 'total_litres_of_pure_alcohol']].round(2)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

#### Per continent:

In [46]:
spirit1 = drinks.groupby('continent').spirit_servings.agg(['mean', 'min', 'max']).round(2)
spirit1

             mean  min  max
continent
AF          16.34    0  152
AS          60.84    0  326
EU         132.56    0  373
OC          58.44    0  254
SA         114.75   25  302

#### Or in general:

In [47]:
drinks['spirit_servings'].agg(['mean', 'min', 'max'])

mean     80.994819
min       0.000000
max     438.000000
Name: spirit_servings, dtype: float64